# UnitFormatUtils Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitFormatUtils Class
Members See Also
---
A utility class for formatting and parsing numbers with units.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static class UnitFormatUtils
```

Visual Basic
---
```text
Public NotInheritable Class UnitFormatUtils
```

Visual C++
---
```text
public ref class UnitFormatUtils abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..UnitFormatUtils
# See Also
UnitFormatUtils Members
Autodesk.Revit.DB Namespace